## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
google_service_account.analyst_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_custom_role.analyst: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/analystRole]
google_project_iam_custom_role.uploader: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/uploaderRole]
google_service_account.function_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_storage_bucket.function_bucket: Refreshing state... [id=tenacious-moon-447908-u4-function-code]
google_project_iam_custom_role.processor: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/processorRole]
google_pubsub_topic.topic: Refreshing state... [id=projects/tenacious-moon-447908-u4/topics/data-processed-topic]
google_storage_bucket.data_bucket: Refreshing state... [id=tenacious-moon-447908-u4-data-bucket]
google_service_account.uploader_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset]
google_storage_bucket_object.function_zip: Refreshing state... [id=tenacious-moon-447908-u4-function-code-function-source.zip]
google_cloudfunctions2_function.function: Refreshing state... [id=projects/tenacious-moon-447908-u4/locations/us-central1/functions/process-uploaded-file]
google_project_iam_member.processor_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/processorRole/serviceAccount:function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.analyst_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/analystRole/serviceAccount:analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.uploader_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/uploaderRole/serviceAccount:uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_bigquery_table.table: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset/tables/processed_data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions2_function.function is tainted, so must be replaced
-/+ resource "google_cloudfunctions2_function" "function" {
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/tenacious-moon-447908-u4/locations/us-central1/functions/process-uploaded-file" -> (known after apply)
      - labels           = {} -> null
        name             = "process-uploaded-file"
      ~ state            = "FAILED" -> (known after apply)
      ~ update_time      = "2025-09-22T10:40:08.658760479Z" -> (known after apply)
      ~ url              = "https://us-central1-tenacious-moon-447908-u4.cloudfunctions.net/process-uploaded-file" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/915446297252/locations/us-central1/builds/27a1c7c7-2833-45cb-819f-7a95bc9a63f9" -> (known after apply)
          ~ docker_repository     = "projects/tenacious-moon-447908-u4/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
          ~ service_account       = "projects/tenacious-moon-447908-u4/serviceAccounts/915446297252-compute@developer.gserviceaccount.com" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ automatic_update_policy {
              + build                 = (known after apply)
              + docker_repository     = (known after apply)
              + entry_point           = (known after apply)
              + environment_variables = (known after apply)
              + runtime               = (known after apply)
              + service_account       = (known after apply)
              + worker_pool           = (known after apply)
            } -> (known after apply)

          ~ source {
              ~ storage_source {
                  ~ generation = 1758537515038894 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"

          + event_filters {
              + attribute = "bucket"
              + value     = "tenacious-moon-447908-u4-data-bucket"
                # (1 unchanged attribute hidden)
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = (known after apply)
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 3
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = "function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # google_storage_bucket_object.function_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "function_zip" {
      ~ crc32c              = "Z1mqhA==" -> (known after apply)
      ~ detect_md5hash      = "5ITV8dz1k2Be+Ni8Z3MLGA==" -> "different hash"
      ~ generation          = 1758537514528882 -> (known after apply)
        id                  = "tenacious-moon-447908-u4-function-code-function-source.zip"
      ~ md5hash             = "5ITV8dz1k2Be+Ni8Z3MLGA==" -> (known after apply)
        name                = "function-source.zip"
        # (17 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>